package com.bulgarian.lawerapp.activity;

import android.content.SharedPreferences;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.text.Html;
import android.text.method.ScrollingMovementMethod;
import android.webkit.WebSettings;
import android.webkit.WebView;
import android.webkit.WebViewClient;
import android.widget.TextView;

import com.bulgarian.lawerapp.other.AppsContants;
import com.bulgarian.lawerapp.R;

public class WebViewActivity extends AppCompatActivity {

    TextView privacyText1, privacyText2, privacyText3;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_web_view);
        privacyText1 = findViewById(R.id.privacyText1);
//        privacyText2 = findViewById(R.id.privacyText2);
//        privacyText3 = findViewById(R.id.privacyText3);
        privacyText1.setMovementMethod(new ScrollingMovementMethod());
//        privacyText2.setMovementMethod(new ScrollingMovementMethod());
//        privacyText3.setMovementMethod(new ScrollingMovementMethod());

        privacyText1.setText(Html.fromHtml("<p><strong>Общи условия за ползване на сайта и мобилното приложение</strong></p>\n" +
                "\n" +
                "<p><strong>&nbsp;</strong></p>\n" +
                "\n" +
                "<p>Използването на уебсайта Advokatasist.com, наричан за краткост &bdquo;сайт&ldquo; и мобилното приложение Advokatasist, наричано за краткост &bdquo;мобилно приложение&ldquo; е обвързано с настоящите общи условия. Използвайки услугите на сайта и мобилното приложение Вие се съгласявате да бъдете обвързан от настоящите Общи условия и всички последващи промени в тях, както и се задължавате да ги спазвате.Те дефинират условията, с които трябва да се съобрази и приеме всеки потребител на сайта и мобилното приложение, при регистрация и при използването на услугите предоставяни от тях. В случай, че потребителят не е съгласен с настоящите условия, моля да не използва сайта и мобилното приложение.</p>\n" +
                "\n" +
                "<p>Сайтът и мобилното приложение са собственост на Цветомила Цветкова (за контакт: тел.: 0883407700, ел. поща: <a href=\"mailto:tsv.tsvetkova@abv.bg\">tsv.tsvetkova@abv.bg</a>и адрес: гр. Бургас, кв. Ветрен, ул. Емине 5А), наричана по-долу за краткост &bdquo;доставчик&ldquo; и са обект на закрила от българското законодателство в областта на интелектуалната собственост.</p>\n" +
                "\n" +
                "<p>&nbsp;</p>\n" +
                "\n" +
                "<p>Чл. 1. Дефиниции</p>\n" +
                "\n" +
                "<p>(1) Платформа или уебсайт &ndash; съвкупност от интернет страници и други файлове, свързани помежду си, които реализират конкретен&nbsp; визуализиран процес&nbsp; в киберпространството&nbsp; и преследват определена цел, като уебсайтът се зарежда във вашия браузър при изписване на електронния адрес <a href=\"http://www.advokatasist.com\">www.advokatasist.com</a>.</p>\n" +
                "\n" +
                "<p>(2)Мобилното приложение&nbsp;- компютърна&nbsp; програма, създадена, за да работи на мобилни устройства като&nbsp;смартфони и таблети.</p>\n" +
                "\n" +
                "<p>(3) Интернет браузър или браузър &ndash; компютърна програма, която се използва за осъществяване на достъп&nbsp; на потребителите до ресурсите на интернет пространството.</p>\n" +
                "\n" +
                "<p>(4) Доставчик &ndash; лице, &nbsp;което предоставя услугите, предмет на настоящите Общи условия, посредством администрираните от него сайт и мобилно приложение</p>\n" +
                "\n" +
                "<p>(5) Потребител &ndash; всяко физическо или юридическо лице, което използва сайтаи/или мобилното приложение чрез специално създаден за целта потребителски профил.</p>\n" +
                "\n" +
                "<p>(6) Имейл адрес &ndash; уникална комбинация от букви, цифри и символи(заедно и поотделно), (лично) въведена при регистрация, чрез която потребителят се индивидуализира в сайта и/или мобилното приложение. Въведеният към потребителския профил на потребителя имейл адрес може да бъде използван също и за осъществяване на контакт с дадения потребител.</p>\n" +
                "\n" +
                "<p>(7) Парола &ndash; уникална комбинация от букви, цифри и символи(заедно и поотделно), гарантираща на потребителя достъп до неговия индивидуален потребителски профил.</p>\n" +
                "\n" +
                "<p>(8) Потребителски профил &ndash; набор от (лично) предоставени данни и/или информация, достъпни на сайта и/или мобилното приложение и свързани с конкретен потребител. Извършване на действия в сайта и/или мобилното приложение от името на даден потребител е възможно единствено след успешна идентификация с имейл адрес и парола, регистрирани към дадения потребителски профил.</p>\n" +
                "\n" +
                "<p>(9)Потребителско съдържание - всякакви данни, информация, тексти всякакви други материали, които потребителят разполага на сървър използван от доставчика с оглед те да бъдат достъпни чрез сайта и мобилното приложение за дадения потребител.&nbsp;</p>\n" +
                "\n" +
                "<p>(10) Злоумишлени действия са действия или бездействия, нарушаващи интернет етиката или нанасящи вреди на лица, свързани към интернет или асоциирани мрежи, изпращане на нежелана поща (SPAM, JUNK MAIL), препълване на каналите (FLOOD), получаване на достъп до ресурси с чужди права и пароли, използване на недостатъци в системите с цел собствена облага или добиване на информация (HACK), извършване на действия, които могат да бъдат квалифицирани като промишлен шпионаж или саботаж, повреждане или разрушаване на системи или информационни масиви (CRACK), сканиране на портове (PORT SCAN), изпращане на &ldquo;троянски коне&rdquo; или предизвикване инсталация на вируси или системи за отдалечен контрол, смущаване нормалната работа на останалите потребители на интернет и асоциираните мрежи, извършване на каквито и да е било действия, които могат да се квалифицират като престъпление/по&nbsp; Глава 9 &bdquo;А&ldquo; : от чл.319А до 319 Е от НК ,респ.чл.212 а от НК/ или административно нарушение по българското законодателство, както и всякакви други действия и/или бездействия, застрашаващи нормалното обичайно функциониране на сайта и мобилното приложение.</p>\n" +
                "\n" +
                "<p>(11) Случайно събитие- непредвидено към момента на сключването на договора обстоятелство от извънреден характер, което прави изпълнението му обективно невъзможно.&nbsp;</p>\n" +
                "\n" +
                "<p>Чл. 2 Предмет на договора</p>\n" +
                "\n" +
                "<p>(1) Сайтът&nbsp;и мобилното приложение предоставят в режим on-line на потребителя предвидените в тези Общи условия услуги (&bdquo;услугите&rdquo;), при стриктно спазване от страна на потребителя на правилата изложени в тези Общи условия.&nbsp;<br />\n" +
                "(2) Използването на услугите на сайта и мобилното приложение е възможно само след предварителна регистрация, създаване на потребителски профил на потребителя и въвеждане на имейл адрес и паролата.</p>\n" +
                "\n" +
                "<p>Чл. 3 Приложно поле и съгласие с общите условия.</p>\n" +
                "\n" +
                "<p>(1) Настоящите Общи условия се прилагат в отношенията с потребителите.<br />\n" +
                "(2) Текстът на настоящите Общи условия е достъпен в Интернет на интернет страница с адрес <a href=\"https://advokatasist.com\">https://advokatasist.com</a> по начин, който позволява неговото съхраняване и възпроизвеждане.</p>\n" +
                "\n" +
                "<p>(3) За да може да използва услугите на сайта и мобилното приложение потребителят трябва предварително да се регистрира, като попълни съответната електронна форма за регистрация, в която чрез отбелязване в полето &quot;Съгласен съм с Общите условия за ползванеи Политика за поверителност&quot; и натискане на виртуалния бутон &quot;Регистрация&quot;, потребителят извършва изрично електронно изявление по смисъла на Закона за електронния документ и електронните удостоверителни услуги, с което декларира, че е запознат с настоящите Общи условия, приема ги, съгласява се с тях и се задължава да ги спазва.&nbsp;</p>\n" +
                "\n" +
                "<p>Чл. 4 Потребителски профил</p>\n" +
                "\n" +
                "<p>(1) При регистрацията си потребителят посочва имейл и парола. Чрез тях потребителят получава достъп до потребителския си профил.&nbsp;</p>\n" +
                "\n" +
                "<p>(2)Потребителят е длъжен да не прави достояние на трети лица паролата си и да уведомява незабавно администратора в случай на неправомерен достъп, както и при вероятност от такъв. Потребителят е длъжен да полага всички грижи и да предприема необходимите мерки, които разумно се налагат, с цел опазване на паролата си и носи пълна отговорност за всички действия, които се извършват от него или от трето лице чрез използването й.&nbsp;</p>\n" +
                "\n" +
                "<p>Чл. 5 Сключване на договора</p>\n" +
                "\n" +
                "<p>(1) Договорът между страните е сключен и поражда действие от момента на постигане на съгласие, дадено от страна на потребителя по начина описан в чл. 3, ал. 3 от настоящите Общи условия.При сключване на договора между потребителя и доставчика, потребителят извършва изрично електронно волеизявление по смисъла на Закона за електронния документи и електронните удостоверителни услуги&nbsp;&nbsp;(ЗЕДЕУУ), с което декларира, че е запознат с Общите условия на сайта и мобилното приложение, приема ги, съгласява се с тях и се задължава да ги спазва, както и че е запознат с Политиката за защита на личните данни и информация на потребителите на същия.&nbsp;&nbsp;</p>\n" +
                "\n" +
                "<p>(2) Договорът има действие за потребителя за неопределен срок от регистриране на потребителя до прекратяването на договора по реда, предвиден в настоящите Общи условия.</p>\n" +
                "\n" +
                "<p>Чл. 6 Промени в общите условия</p>\n" +
                "\n" +
                "<p>(1) Общите условия могат да бъдат променяни едностранно от доставчика във връзка с промяна на предлаганите услуги или прекратяване на тяхното предоставяне, промяна в икономическите условия, законодателни промени или когато доставчикът прецени това за необходимо.</p>\n" +
                "\n" +
                "<p>(2) Промените в Общите условия се публикуват на сайта, като потребителите могат в двуседмичен срок да се запознаят с тях, след което те влизат в сила.</p>\n" +
                "\n" +
                "<p>Чл. 7 Права и задължения на потребителя</p>\n" +
                "\n" +
                "<p>(1) Потребителят сам осигурява необходимото му за ползването на предоставяните от доставчика услуги, клиентско оборудване (крайни устройства за достъп до Интернет и съответни софтуерни приложения) и достъп до интернет.</p>\n" +
                "\n" +
                "<p>(2) Потребителят има право на достъп в режим on-line до услугите, предоставяни чрез сайта и мобилното приложение, при спазване на условията и изискванията за достъп, определени от доставчика.&nbsp;</p>\n" +
                "\n" +
                "<p>(3) Потребителят се задължава при ползване на предоставяните от доставчика услуги:&nbsp;</p>\n" +
                "\n" +
                "<p>а. да не извършва злоумишлени действия по смисъла на настоящите Общи условия;&nbsp;</p>\n" +
                "\n" +
                "<p>б. да уведомява незабавно доставчика за всеки случай на извършено или открито нарушение при използване на предоставяните услуги;&nbsp;</p>\n" +
                "\n" +
                "<p>в. да не се представя за друго лице или за представител на юридическо лице или група хора, които не е оправомощен да представлява;&nbsp;</p>\n" +
                "\n" +
                "<p>г. да не използва методи, водещи до принудително зареждане на нежелано от Интернет-потребителите съдържание (&quot;pop-up&quot;, &quot;blindlink&quot; и други подобни).</p>\n" +
                "\n" +
                "<p>(4) Потребителят има право по всяко време по своя собствена преценка да прекрати използването на предоставяните от доставчика услуги, като прекрати регистрацията си на сайта и мобилното приложение. От момента на прекратяване на регистрацията договорът между страните се счита за автоматично прекратен, а доставчикът спира достъпа на съответния потребител до потребителския му профил и има право да изтрие от сървърите, които използва цялото разположено от него потребителско съдържание в съответствие с чл. 12, ал. 2 от настоящите Общи условия.</p>\n" +
                "\n" +
                "<p>(5) Потребителят се задължава да не осъществява и да не се опитва да придобива неоторизиран достъп до предоставяните от доставчика услуги чрез прихващане и използване на чужди пароли или каквито и да било други методи, да не заобикаля, поврежда или по друг начин да не смущава нормалната работа на технически или софтуерни приложения на сайта и мобилното приложение, които предотвратяват или ограничават достъпа административни панели, компютърни системи и мрежи, свързани с предоставяните услуги.</p>\n" +
                "\n" +
                "<p>Чл. 8 Права и задължения на доставчика</p>\n" +
                "\n" +
                "<p>(1) Доставчикът&nbsp;се задължава да полага дължимата грижа за предоставяне на възможност на потребителя за нормално ползване на услугите.</p>\n" +
                "\n" +
                "<p>(2) В съответствие с изискванията на действащото българско законодателство доставчика съхранява информационни материали и ресурс, разположени от потребителя на сървър и има право да ги предоставя на компетентните държавни органи в случаите, когато това е необходимо за запазване правата, законните интереси и сигурността на доставчика или на трети лица, както и в случаите, когато същите са изискани от съответните държавни органи по надлежен ред.</p>\n" +
                "\n" +
                "<p>(3) В случай на неизползване на потребителския профил на потребител в продължение на 60 дни след регистрацията или изтекат 120 дни от последното му използване, доставчика има право да спре без предизвестие достъпа на съответния потребител до потребителския му профил, да прекрати регистрацията му и да изтрие от сървърите си цялото разположено от него потребителско съдържание. От момента на прекратяване на регистрацията договорът с потребителя се счита за автоматично прекратен.&nbsp;</p>\n" +
                "\n" +
                "<p>(4) Доставчикът има правото да поставя на всяка от страниците на сайта и мобилното приложение, включително в потребителските профили, рекламни банери и други рекламни форми за стоки и услуги, предлагани от доставчика или трети лица, както и електронни препратки и рекламни банери, сочещи към уебсайтове, намиращи се извън контрола на доставчика. Доставчикът не носи отговорност за съдържанието, верността и законосъобразността на подобни Интернет страници или ресурси и на услуги или ресурси, които са станали достояние на потребителя при ползването услугите на сайта и мобилното приложение.</p>\n" +
                "\n" +
                "<p>(5) Доставчикът си запазва правото временно или трайно да преустановява предоставянето на услугите или конкретна услуга, достъпни чрез сайта и/или мобилното приложение, като уведоми за това потребителя със съобщение на съответните интернет страници или в потребителския му профил.&nbsp;</p>\n" +
                "\n" +
                "<p>(6) Доставчикът има правото без предизвестие да дезактивира паролата за достъп до потребителския профил на потребител в случай, че по преценка на доставчика потребителят нарушава разпоредби на действащото българско законодателство, на настоящите Общи условия или правата и законните интереси на трети лица. В тези случаи доставчика има право да прекрати регистрацията на потребителя, да преустанови предоставянето на потребителя на услуги и да изтрие от сървърите цялото разположено от него потребителско съдържание. Договорът с потребителя се счита за автоматично прекратен от датата на прекратяване на регистрацията му.</p>\n" +
                "\n" +
                "<p>Чл. 9 Права на интелектуална собственост</p>\n" +
                "\n" +
                "<p>(1) Правата на интелектуална собственост върху всички обекти на интелектуална собственост &ndash; материали, бази данни и други ресурси, разположени на сайта и мобилното приложение, извън потребителското съдържание, разположено от потребителя, са обект на закрила съгласно Закона за авторското право и сродните му права и/или Закона за марките и географските означения, принадлежат на доставчика или на съответно указаното лице, преотстъпило правото на ползване на доставчика и не могат да бъдат използвани в нарушение на действащото законодателство.&nbsp;</p>\n" +
                "\n" +
                "<p>(2)Доставчикът може да съхранява в лог-файлове на своя сървър IP адреса на потребителя, както и всяка друга необходима информация, необходима за идентифициране на потребителя и възпроизвеждане на електронното му изявление за приемане на тези Обши условия, както и за извършване на други електронни изявления, в случай на възникване на правен спор.</p>\n" +
                "\n" +
                "<p>Чл. 10 Отговорност. Ограничаване на отговорността.</p>\n" +
                "\n" +
                "<p>(1)Доставчикът полага грижи за предоставяне на възможност на потребителя за нормално ползване на услугите, но доколкото предоставянето им е безплатно няма задължението и не гарантира, че те ще удовлетворят изискванията на потребителя, нито че ще бъдат непрекъснати, навременни или сигурни. С приемане на настоящите Общи условия, потребителят декларира, че използването на предоставяните услуги ще бъде изцяло на негов риск и отговорност, а страните се съгласяват, че доставчикът не отговоря за евентуално причинени на потребителяпри ползване на предоставяните услуги вреди, освен ако са причинени от доставчика умишлено.</p>\n" +
                "\n" +
                "<p>(2)Доставчикът не носи отговорност за целите и дейността на потребителя във връзка с използване на услугите, както и за вида и характера на потребителското съдържание.</p>\n" +
                "\n" +
                "<p>(3)Доставчикът не носи отговорност за наличността и качеството на стоки и съдържанието на услуги, поставени на вниманието на потребителя чрез публикуване на сайта и мобилното приложение на електронни препратки, рекламни банери и съобщения за продажба на стоки и предоставяне на услуги от трети лица. Доколкото действията на тези трети лица не са под контрола на доставчика, то същият не носи отговорност за противоправния характер на дейността на третите лица или за възникването, гарантирането, изпълнението, изменението и прекратяването на поети задължения и ангажименти във връзка с предлаганите от третите лица стоки и услуги, както и не отговаря за претърпени вреди и пропуснати ползи, произтекли от тези отношения.&nbsp;</p>\n" +
                "\n" +
                "<p>(4)Доставчикът не носи отговорност за непредоставяне на услугите при настъпване на обстоятелства извън неговия контрол &ndash; в случаи на непреодолима сила, случайни събития, проблеми в глобалната мрежа Интернет и в предоставянето на услуги извън контрола на доставчика, проблеми, дължащи се на оборудването на потребителя, както и при случай на нерегламентиран достъп или интервенция на трети лица във функционирането на информационната система или сървърите използвани от доставчика.&nbsp;</p>\n" +
                "\n" +
                "<p>(5)Доставчикът не носи отговорност за вреди, причинени на софтуера, хардуера или съоръженията на потребителя, или за загуба на данни, произтекли от материали или ресурси, търсени, заредени или използвани по какъвто и да било начин посредством предоставяните услуги.&nbsp;</p>\n" +
                "\n" +
                "<p>(6)Доставчикът не носи отговорност спрямо потребителя и трети лица, за претърпени вреди и пропуснати ползи, настъпили вследствие прекратяване, спиране, променяне или ограничаване предоставянето на която и да било от услугите достъпни чрез сайта и мобилното приложение.</p>\n" +
                "\n" +
                "<p>(7) Страните приемат, че доставчика не носи отговорност за непредоставянето на услугите или предоставянето им с влошено качество.</p>\n" +
                "\n" +
                "<p>(8) С приемането на настоящите Общи условия потребителят декларира, че осъзнава възможността за евентуални прекъсвания и друг вид затруднения при осъществяване на Интернет връзката до сайта и мобилното приложение, които могат да възникнат независимо от положената от страна на доставчика грижа. потребителятдекларира, че няма да претендира каквито и да било обезщетения от доставчика за пропуснати ползи, претърпени вреди или неудобства, вследствие настъпване на посочените по-горе прекъсвания или затруднения на Интернет връзката, включително и по отношение на капацитета на тази връзка.</p>\n" +
                "\n" +
                "<p>(9) Доставчикът не носи отговорност и не дължи обезщетение на лице, чиито лични данни са недобросъвестно използвани от друго лице за заявяването и ползването на услугите, предоставяни от доставчика, независимо дали лицето &ndash; субект на данните е дало или не съгласие за това.&nbsp;Опазването на личните им данни е основно задължение на субектите на данните.</p>\n" +
                "\n" +
                "<p>(10) Доставчикът не носи отговорност за претърпени вреди и пропуснати ползи от потребителя или трети лица, настъпили вследствие спирането, променянето или ограничаването на услугите, прекратяването на договора или предоставяне на информация или изпълнение на разпореждания на компетентните държавни органи.&nbsp;<br />\n" +
                "<br />\n" +
                "Чл. 11 Защита на личните данни.</p>\n" +
                "\n" +
                "<p>Доставчикът полага дължимата грижа за събирането, обработването и съхраняването на личните данни на потребителите, при стриктно спазване на разпоредбите на Закона за защита на личните данни, Регламент (ЕС) 2016/679 на Европейския парламент и на Съвета от 27 април 2016 година относно защитата на физическите лица във връзка с обработването на лични данни и относно свободното движение на такива данни и за отмяна на Директива 95/46/EО (Общ регламент относно защитата на данните), и свързаното българско и европейско законодателство.&nbsp;Политиката ни за защита на личните данни и информацията на потребителите е публикувана на сайта и достъпна за потребителя по всяко време.</p>\n" +
                "\n" +
                "<p>Чл. 12 Прекратяване и разваляне на договора</p>\n" +
                "\n" +
                "<p>(1) Освен в случаите, предвидени в настоящите Общи условия, договорът между страните се прекратява и при настъпване на някое от следните обстоятелства:&nbsp;<br />\n" +
                "а/ преустановяване на дейността на доставчика или прекратяване на поддържането на сайта и/или мобилното приложение;</p>\n" +
                "\n" +
                "<p>б/ взаимно съгласие на страните за прекратяването;</p>\n" +
                "\n" +
                "<p>в/ други предвидени в закона случаи.&nbsp;</p>\n" +
                "\n" +
                "<p>(2) В случай на прекратяване на договора между страните на каквото и да е основание, доставчика има право да спре незабавно достъпа на съответния потребител &nbsp;до потребителския му профил, да прекрати регистрацията му и да изтрие от сървъритеси цялото разположено от него потребителско съдържание, при спазване на изискванията на приложимото законодателство. В случай на прекратяване на договора доставчика не носи отговорност за претърпени вреди и пропуснати ползи от потребителя или трети лица, настъпили вследствие на спирането на достъпа на потребителя до потребителския му профил, прекратяването на регистрацията му, изтриването на разположеното от него потребителско съдържание от сървърите, които доставчика използва, както и вследствие предоставянето на информация или изпълнение на разпореждания на компетентните държавни органи.&nbsp;<br />\n" +
                "Чл. 13 Заключителни разпоредби</p>\n" +
                "\n" +
                "<p>(1) Предвидените в договора и настоящите Общи условия писмени или електронни изявления и съобщения се считат за валидно извършени, ако са направени под формата на писмо с обратна разписка, електронна поща, натискане на виртуален бутон в сайта или мобилното приложение и други подобни, доколкото изявлението е записано технически по начин, който дава възможност да бъде възпроизведено.</p>\n" +
                "\n" +
                "<p>(2) С приемане на настоящите Общи условия и сключване на договор помежду си, страните изразяват съгласието си да считат отправените електронни изявления помежду им за получени с постъпването им в посочената от адресата информационна система, без за това да е необходимо изрично потвърждаване.<br />\n" +
                "В случай, че потребителят е посочил невалидна електронна пощенска кутия, то изявлението ще се счита за получено само с изпращането му от доставчика, дори ако не е било получено.</p>\n" +
                "\n" +
                "<p>(3) Страните се съгласяват, че в случай, че някоя от клаузите по настоящите Общи условия се окаже недействителна, това няма да влече недействителност на договора, на други клаузи или негови части. Недействителната клауза ще бъде заместена от повелителните норми на закона или установената практика.</p>\n" +
                "\n" +
                "<p>(4)Сайтът и мобилното приложение се поддържат от доставчика посредством техническо оборудване, разположено на територията на Република България. Доставчикът не гарантира и не носи отговорност за достъпността и надлежното предоставяне на услугите на сайта и мобилното приложение извън територията на Република България. В случай, че потребителят ползва услугите, предмет на настоящите Общи условия, извън територията на Република България, той е единствено отговорен за спазване на приложимото законодателство съобразно с мястото на ползване на услугите.</p>\n" +
                "\n" +
                "<p>(5) За всички неуредени от настоящия договор въпроси се прилагат разпоредбите на действащото законодателство на Република България.</p>\n" +
                "\n" +
                "<p>(6) Всички спорове между страните се решават в дух на разбирателство и добра воля. В случай, че съгласие не бъде постигнато, всички неразрешени спорове, породени от договора между страните или отнасящи се до него, включително спорове, породени или отнасящи се до неговото тълкуване, недействителност, изпълнение или прекратяване, както и спорове за попълване на празноти в договора или приспособяването му към нововъзникнали обстоятелства, ще бъдат разрешавани от компетентния по действащото българско законодателство съд.&nbsp;</p>\n" +
                "\n" +
                "<p><br />\n" +
                "Настоящите Общи условия са в сила от 06.05.2019&nbsp;г.</p>\n" +
                "\n" +
                "<p>&nbsp;</p>\n" +
                "\n" +
                "<p>&nbsp;</p>\n" +
                "\n" +
                "<p>&nbsp;</p>\n" +
                "\n" +
                "<p>&nbsp;</p>\n"));
//        privacyText2.setText(Html.fromHtml("<p>АДВОКАТАСИСТ е безплатен онлайн органайзер, предназначен и специализиран да бъде използван от адвокати и юристи, като е създаден с цел да отговори на специфичните нужди на адвокатската практика.</p>\n" +
//                "\n" +
//                "<p>Уебсайта и мобилното приложение АДВОКАТАСИСТ са изцяло на български език и са съобразени с българската правораздавателна система, което ги прави много лесни и удобни за използване.</p>\n" +
//                "\n" +
//                "<p>Използвайки АДВОКАТАСИСТ можете да организирате делата си, срещите с клиенти и всички задачи на едно място, като ще имате достъп до тях по всяко време, на всяко място и от всяко устройство, което има връзка с интернет.</p>\n" +
//                "\n" +
//                "<p>Можете да добавите и сътрудници, който да въвеждат данни за Вас, като актуализирането става автоматично и информацията е достъпна за Вас веднага.</p>\n"));
//        privacyText3.setText(Html.fromHtml("<p><strong>Общи условия за ползване на сайта и мобилното приложение</strong></p>\n" +
//                "\n" +
//                "<p><strong>&nbsp;</strong></p>\n" +
//                "\n" +
//                "<p>Използването на уебсайта Advokatasist.com, наричан за краткост &bdquo;сайт&ldquo; и мобилното приложение Advokatasist, наричано за краткост &bdquo;мобилно приложение&ldquo; е обвързано с настоящите общи условия. Използвайки услугите на сайта и мобилното приложение Вие се съгласявате да бъдете обвързан от настоящите Общи условия и всички последващи промени в тях, както и се задължавате да ги спазвате.Те дефинират условията, с които трябва да се съобрази и приеме всеки потребител на сайта и мобилното приложение, при регистрация и при използването на услугите предоставяни от тях. В случай, че потребителят не е съгласен с настоящите условия, моля да не използва сайта и мобилното приложение.</p>\n" +
//                "\n" +
//                "<p>Сайтът и мобилното приложение са собственост на Цветомила Цветкова (за контакт: тел.: 0883407700, ел. поща: <a href=\"mailto:tsv.tsvetkova@abv.bg\">tsv.tsvetkova@abv.bg</a>и адрес: гр. Бургас, кв. Ветрен, ул. Емине 5А), наричана по-долу за краткост &bdquo;доставчик&ldquo; и са обект на закрила от българското законодателство в областта на интелектуалната собственост.</p>\n" +
//                "\n" +
//                "<p>&nbsp;</p>\n" +
//                "\n" +
//                "<p>Чл. 1. Дефиниции</p>\n" +
//                "\n" +
//                "<p>(1) Платформа или уебсайт &ndash; съвкупност от интернет страници и други файлове, свързани помежду си, които реализират конкретен&nbsp; визуализиран процес&nbsp; в киберпространството&nbsp; и преследват определена цел, като уебсайтът се зарежда във вашия браузър при изписване на електронния адрес <a href=\"http://www.advokatasist.com\">www.advokatasist.com</a>.</p>\n" +
//                "\n" +
//                "<p>(2)Мобилното приложение&nbsp;- компютърна&nbsp; програма, създадена, за да работи на мобилни устройства като&nbsp;смартфони и таблети.</p>\n" +
//                "\n" +
//                "<p>(3) Интернет браузър или браузър &ndash; компютърна програма, която се използва за осъществяване на достъп&nbsp; на потребителите до ресурсите на интернет пространството.</p>\n" +
//                "\n" +
//                "<p>(4) Доставчик &ndash; лице, &nbsp;което предоставя услугите, предмет на настоящите Общи условия, посредством администрираните от него сайт и мобилно приложение</p>\n" +
//                "\n" +
//                "<p>(5) Потребител &ndash; всяко физическо или юридическо лице, което използва сайтаи/или мобилното приложение чрез специално създаден за целта потребителски профил.</p>\n" +
//                "\n" +
//                "<p>(6) Имейл адрес &ndash; уникална комбинация от букви, цифри и символи(заедно и поотделно), (лично) въведена при регистрация, чрез която потребителят се индивидуализира в сайта и/или мобилното приложение. Въведеният към потребителския профил на потребителя имейл адрес може да бъде използван също и за осъществяване на контакт с дадения потребител.</p>\n" +
//                "\n" +
//                "<p>(7) Парола &ndash; уникална комбинация от букви, цифри и символи(заедно и поотделно), гарантираща на потребителя достъп до неговия индивидуален потребителски профил.</p>\n" +
//                "\n" +
//                "<p>(8) Потребителски профил &ndash; набор от (лично) предоставени данни и/или информация, достъпни на сайта и/или мобилното приложение и свързани с конкретен потребител. Извършване на действия в сайта и/или мобилното приложение от името на даден потребител е възможно единствено след успешна идентификация с имейл адрес и парола, регистрирани към дадения потребителски профил.</p>\n" +
//                "\n" +
//                "<p>(9)Потребителско съдържание - всякакви данни, информация, тексти всякакви други материали, които потребителят разполага на сървър използван от доставчика с оглед те да бъдат достъпни чрез сайта и мобилното приложение за дадения потребител.&nbsp;</p>\n" +
//                "\n" +
//                "<p>(10) Злоумишлени действия са действия или бездействия, нарушаващи интернет етиката или нанасящи вреди на лица, свързани към интернет или асоциирани мрежи, изпращане на нежелана поща (SPAM, JUNK MAIL), препълване на каналите (FLOOD), получаване на достъп до ресурси с чужди права и пароли, използване на недостатъци в системите с цел собствена облага или добиване на информация (HACK), извършване на действия, които могат да бъдат квалифицирани като промишлен шпионаж или саботаж, повреждане или разрушаване на системи или информационни масиви (CRACK), сканиране на портове (PORT SCAN), изпращане на &ldquo;троянски коне&rdquo; или предизвикване инсталация на вируси или системи за отдалечен контрол, смущаване нормалната работа на останалите потребители на интернет и асоциираните мрежи, извършване на каквито и да е било действия, които могат да се квалифицират като престъпление/по&nbsp; Глава 9 &bdquo;А&ldquo; : от чл.319А до 319 Е от НК ,респ.чл.212 а от НК/ или административно нарушение по българското законодателство, както и всякакви други действия и/или бездействия, застрашаващи нормалното обичайно функциониране на сайта и мобилното приложение.</p>\n" +
//                "\n" +
//                "<p>(11) Случайно събитие- непредвидено към момента на сключването на договора обстоятелство от извънреден характер, което прави изпълнението му обективно невъзможно.&nbsp;</p>\n" +
//                "\n" +
//                "<p>Чл. 2 Предмет на договора</p>\n" +
//                "\n" +
//                "<p>(1) Сайтът&nbsp;и мобилното приложение предоставят в режим on-line на потребителя предвидените в тези Общи условия услуги (&bdquo;услугите&rdquo;), при стриктно спазване от страна на потребителя на правилата изложени в тези Общи условия.&nbsp;<br />\n" +
//                "(2) Използването на услугите на сайта и мобилното приложение е възможно само след предварителна регистрация, създаване на потребителски профил на потребителя и въвеждане на имейл адрес и паролата.</p>\n" +
//                "\n" +
//                "<p>Чл. 3 Приложно поле и съгласие с общите условия.</p>\n" +
//                "\n" +
//                "<p>(1) Настоящите Общи условия се прилагат в отношенията с потребителите.<br />\n" +
//                "(2) Текстът на настоящите Общи условия е достъпен в Интернет на интернет страница с адрес <a href=\"https://advokatasist.com\">https://advokatasist.com</a> по начин, който позволява неговото съхраняване и възпроизвеждане.</p>\n" +
//                "\n" +
//                "<p>(3) За да може да използва услугите на сайта и мобилното приложение потребителят трябва предварително да се регистрира, като попълни съответната електронна форма за регистрация, в която чрез отбелязване в полето &quot;Съгласен съм с Общите условия за ползванеи Политика за поверителност&quot; и натискане на виртуалния бутон &quot;Регистрация&quot;, потребителят извършва изрично електронно изявление по смисъла на Закона за електронния документ и електронните удостоверителни услуги, с което декларира, че е запознат с настоящите Общи условия, приема ги, съгласява се с тях и се задължава да ги спазва.&nbsp;</p>\n" +
//                "\n" +
//                "<p>Чл. 4 Потребителски профил</p>\n" +
//                "\n" +
//                "<p>(1) При регистрацията си потребителят посочва имейл и парола. Чрез тях потребителят получава достъп до потребителския си профил.&nbsp;</p>\n" +
//                "\n" +
//                "<p>(2)Потребителят е длъжен да не прави достояние на трети лица паролата си и да уведомява незабавно администратора в случай на неправомерен достъп, както и при вероятност от такъв. Потребителят е длъжен да полага всички грижи и да предприема необходимите мерки, които разумно се налагат, с цел опазване на паролата си и носи пълна отговорност за всички действия, които се извършват от него или от трето лице чрез използването й.&nbsp;</p>\n" +
//                "\n" +
//                "<p>Чл. 5 Сключване на договора</p>\n" +
//                "\n" +
//                "<p>(1) Договорът между страните е сключен и поражда действие от момента на постигане на съгласие, дадено от страна на потребителя по начина описан в чл. 3, ал. 3 от настоящите Общи условия.При сключване на договора между потребителя и доставчика, потребителят извършва изрично електронно волеизявление по смисъла на Закона за електронния документи и електронните удостоверителни услуги&nbsp;&nbsp;(ЗЕДЕУУ), с което декларира, че е запознат с Общите условия на сайта и мобилното приложение, приема ги, съгласява се с тях и се задължава да ги спазва, както и че е запознат с Политиката за защита на личните данни и информация на потребителите на същия.&nbsp;&nbsp;</p>\n" +
//                "\n" +
//                "<p>(2) Договорът има действие за потребителя за неопределен срок от регистриране на потребителя до прекратяването на договора по реда, предвиден в настоящите Общи условия.</p>\n" +
//                "\n" +
//                "<p>Чл. 6 Промени в общите условия</p>\n" +
//                "\n" +
//                "<p>(1) Общите условия могат да бъдат променяни едностранно от доставчика във връзка с промяна на предлаганите услуги или прекратяване на тяхното предоставяне, промяна в икономическите условия, законодателни промени или когато доставчикът прецени това за необходимо.</p>\n" +
//                "\n" +
//                "<p>(2) Промените в Общите условия се публикуват на сайта, като потребителите могат в двуседмичен срок да се запознаят с тях, след което те влизат в сила.</p>\n" +
//                "\n" +
//                "<p>Чл. 7 Права и задължения на потребителя</p>\n" +
//                "\n" +
//                "<p>(1) Потребителят сам осигурява необходимото му за ползването на предоставяните от доставчика услуги, клиентско оборудване (крайни устройства за достъп до Интернет и съответни софтуерни приложения) и достъп до интернет.</p>\n" +
//                "\n" +
//                "<p>(2) Потребителят има право на достъп в режим on-line до услугите, предоставяни чрез сайта и мобилното приложение, при спазване на условията и изискванията за достъп, определени от доставчика.&nbsp;</p>\n" +
//                "\n" +
//                "<p>(3) Потребителят се задължава при ползване на предоставяните от доставчика услуги:&nbsp;</p>\n" +
//                "\n" +
//                "<p>а. да не извършва злоумишлени действия по смисъла на настоящите Общи условия;&nbsp;</p>\n" +
//                "\n" +
//                "<p>б. да уведомява незабавно доставчика за всеки случай на извършено или открито нарушение при използване на предоставяните услуги;&nbsp;</p>\n" +
//                "\n" +
//                "<p>в. да не се представя за друго лице или за представител на юридическо лице или група хора, които не е оправомощен да представлява;&nbsp;</p>\n" +
//                "\n" +
//                "<p>г. да не използва методи, водещи до принудително зареждане на нежелано от Интернет-потребителите съдържание (&quot;pop-up&quot;, &quot;blindlink&quot; и други подобни).</p>\n" +
//                "\n" +
//                "<p>(4) Потребителят има право по всяко време по своя собствена преценка да прекрати използването на предоставяните от доставчика услуги, като прекрати регистрацията си на сайта и мобилното приложение. От момента на прекратяване на регистрацията договорът между страните се счита за автоматично прекратен, а доставчикът спира достъпа на съответния потребител до потребителския му профил и има право да изтрие от сървърите, които използва цялото разположено от него потребителско съдържание в съответствие с чл. 12, ал. 2 от настоящите Общи условия.</p>\n" +
//                "\n" +
//                "<p>(5) Потребителят се задължава да не осъществява и да не се опитва да придобива неоторизиран достъп до предоставяните от доставчика услуги чрез прихващане и използване на чужди пароли или каквито и да било други методи, да не заобикаля, поврежда или по друг начин да не смущава нормалната работа на технически или софтуерни приложения на сайта и мобилното приложение, които предотвратяват или ограничават достъпа административни панели, компютърни системи и мрежи, свързани с предоставяните услуги.</p>\n" +
//                "\n" +
//                "<p>Чл. 8 Права и задължения на доставчика</p>\n" +
//                "\n" +
//                "<p>(1) Доставчикът&nbsp;се задължава да полага дължимата грижа за предоставяне на възможност на потребителя за нормално ползване на услугите.</p>\n" +
//                "\n" +
//                "<p>(2) В съответствие с изискванията на действащото българско законодателство доставчика съхранява информационни материали и ресурс, разположени от потребителя на сървър и има право да ги предоставя на компетентните държавни органи в случаите, когато това е необходимо за запазване правата, законните интереси и сигурността на доставчика или на трети лица, както и в случаите, когато същите са изискани от съответните държавни органи по надлежен ред.</p>\n" +
//                "\n" +
//                "<p>(3) В случай на неизползване на потребителския профил на потребител в продължение на 60 дни след регистрацията или изтекат 120 дни от последното му използване, доставчика има право да спре без предизвестие достъпа на съответния потребител до потребителския му профил, да прекрати регистрацията му и да изтрие от сървърите си цялото разположено от него потребителско съдържание. От момента на прекратяване на регистрацията договорът с потребителя се счита за автоматично прекратен.&nbsp;</p>\n" +
//                "\n" +
//                "<p>(4) Доставчикът има правото да поставя на всяка от страниците на сайта и мобилното приложение, включително в потребителските профили, рекламни банери и други рекламни форми за стоки и услуги, предлагани от доставчика или трети лица, както и електронни препратки и рекламни банери, сочещи към уебсайтове, намиращи се извън контрола на доставчика. Доставчикът не носи отговорност за съдържанието, верността и законосъобразността на подобни Интернет страници или ресурси и на услуги или ресурси, които са станали достояние на потребителя при ползването услугите на сайта и мобилното приложение.</p>\n" +
//                "\n" +
//                "<p>(5) Доставчикът си запазва правото временно или трайно да преустановява предоставянето на услугите или конкретна услуга, достъпни чрез сайта и/или мобилното приложение, като уведоми за това потребителя със съобщение на съответните интернет страници или в потребителския му профил.&nbsp;</p>\n" +
//                "\n" +
//                "<p>(6) Доставчикът има правото без предизвестие да дезактивира паролата за достъп до потребителския профил на потребител в случай, че по преценка на доставчика потребителят нарушава разпоредби на действащото българско законодателство, на настоящите Общи условия или правата и законните интереси на трети лица. В тези случаи доставчика има право да прекрати регистрацията на потребителя, да преустанови предоставянето на потребителя на услуги и да изтрие от сървърите цялото разположено от него потребителско съдържание. Договорът с потребителя се счита за автоматично прекратен от датата на прекратяване на регистрацията му.</p>\n" +
//                "\n" +
//                "<p>Чл. 9 Права на интелектуална собственост</p>\n" +
//                "\n" +
//                "<p>(1) Правата на интелектуална собственост върху всички обекти на интелектуална собственост &ndash; материали, бази данни и други ресурси, разположени на сайта и мобилното приложение, извън потребителското съдържание, разположено от потребителя, са обект на закрила съгласно Закона за авторското право и сродните му права и/или Закона за марките и географските означения, принадлежат на доставчика или на съответно указаното лице, преотстъпило правото на ползване на доставчика и не могат да бъдат използвани в нарушение на действащото законодателство.&nbsp;</p>\n" +
//                "\n" +
//                "<p>(2)Доставчикът може да съхранява в лог-файлове на своя сървър IP адреса на потребителя, както и всяка друга необходима информация, необходима за идентифициране на потребителя и възпроизвеждане на електронното му изявление за приемане на тези Обши условия, както и за извършване на други електронни изявления, в случай на възникване на правен спор.</p>\n" +
//                "\n" +
//                "<p>Чл. 10 Отговорност. Ограничаване на отговорността.</p>\n" +
//                "\n" +
//                "<p>(1)Доставчикът полага грижи за предоставяне на възможност на потребителя за нормално ползване на услугите, но доколкото предоставянето им е безплатно няма задължението и не гарантира, че те ще удовлетворят изискванията на потребителя, нито че ще бъдат непрекъснати, навременни или сигурни. С приемане на настоящите Общи условия, потребителят декларира, че използването на предоставяните услуги ще бъде изцяло на негов риск и отговорност, а страните се съгласяват, че доставчикът не отговоря за евентуално причинени на потребителяпри ползване на предоставяните услуги вреди, освен ако са причинени от доставчика умишлено.</p>\n" +
//                "\n" +
//                "<p>(2)Доставчикът не носи отговорност за целите и дейността на потребителя във връзка с използване на услугите, както и за вида и характера на потребителското съдържание.</p>\n" +
//                "\n" +
//                "<p>(3)Доставчикът не носи отговорност за наличността и качеството на стоки и съдържанието на услуги, поставени на вниманието на потребителя чрез публикуване на сайта и мобилното приложение на електронни препратки, рекламни банери и съобщения за продажба на стоки и предоставяне на услуги от трети лица. Доколкото действията на тези трети лица не са под контрола на доставчика, то същият не носи отговорност за противоправния характер на дейността на третите лица или за възникването, гарантирането, изпълнението, изменението и прекратяването на поети задължения и ангажименти във връзка с предлаганите от третите лица стоки и услуги, както и не отговаря за претърпени вреди и пропуснати ползи, произтекли от тези отношения.&nbsp;</p>\n" +
//                "\n" +
//                "<p>(4)Доставчикът не носи отговорност за непредоставяне на услугите при настъпване на обстоятелства извън неговия контрол &ndash; в случаи на непреодолима сила, случайни събития, проблеми в глобалната мрежа Интернет и в предоставянето на услуги извън контрола на доставчика, проблеми, дължащи се на оборудването на потребителя, както и при случай на нерегламентиран достъп или интервенция на трети лица във функционирането на информационната система или сървърите използвани от доставчика.&nbsp;</p>\n" +
//                "\n" +
//                "<p>(5)Доставчикът не носи отговорност за вреди, причинени на софтуера, хардуера или съоръженията на потребителя, или за загуба на данни, произтекли от материали или ресурси, търсени, заредени или използвани по какъвто и да било начин посредством предоставяните услуги.&nbsp;</p>\n" +
//                "\n" +
//                "<p>(6)Доставчикът не носи отговорност спрямо потребителя и трети лица, за претърпени вреди и пропуснати ползи, настъпили вследствие прекратяване, спиране, променяне или ограничаване предоставянето на която и да било от услугите достъпни чрез сайта и мобилното приложение.</p>\n" +
//                "\n" +
//                "<p>(7) Страните приемат, че доставчика не носи отговорност за непредоставянето на услугите или предоставянето им с влошено качество.</p>\n" +
//                "\n" +
//                "<p>(8) С приемането на настоящите Общи условия потребителят декларира, че осъзнава възможността за евентуални прекъсвания и друг вид затруднения при осъществяване на Интернет връзката до сайта и мобилното приложение, които могат да възникнат независимо от положената от страна на доставчика грижа. потребителятдекларира, че няма да претендира каквито и да било обезщетения от доставчика за пропуснати ползи, претърпени вреди или неудобства, вследствие настъпване на посочените по-горе прекъсвания или затруднения на Интернет връзката, включително и по отношение на капацитета на тази връзка.</p>\n" +
//                "\n" +
//                "<p>(9) Доставчикът не носи отговорност и не дължи обезщетение на лице, чиито лични данни са недобросъвестно използвани от друго лице за заявяването и ползването на услугите, предоставяни от доставчика, независимо дали лицето &ndash; субект на данните е дало или не съгласие за това.&nbsp;Опазването на личните им данни е основно задължение на субектите на данните.</p>\n" +
//                "\n" +
//                "<p>(10) Доставчикът не носи отговорност за претърпени вреди и пропуснати ползи от потребителя или трети лица, настъпили вследствие спирането, променянето или ограничаването на услугите, прекратяването на договора или предоставяне на информация или изпълнение на разпореждания на компетентните държавни органи.&nbsp;<br />\n" +
//                "<br />\n" +
//                "Чл. 11 Защита на личните данни.</p>\n" +
//                "\n" +
//                "<p>Доставчикът полага дължимата грижа за събирането, обработването и съхраняването на личните данни на потребителите, при стриктно спазване на разпоредбите на Закона за защита на личните данни, Регламент (ЕС) 2016/679 на Европейския парламент и на Съвета от 27 април 2016 година относно защитата на физическите лица във връзка с обработването на лични данни и относно свободното движение на такива данни и за отмяна на Директива 95/46/EО (Общ регламент относно защитата на данните), и свързаното българско и европейско законодателство.&nbsp;Политиката ни за защита на личните данни и информацията на потребителите е публикувана на сайта и достъпна за потребителя по всяко време.</p>\n" +
//                "\n" +
//                "<p>Чл. 12 Прекратяване и разваляне на договора</p>\n" +
//                "\n" +
//                "<p>(1) Освен в случаите, предвидени в настоящите Общи условия, договорът между страните се прекратява и при настъпване на някое от следните обстоятелства:&nbsp;<br />\n" +
//                "а/ преустановяване на дейността на доставчика или прекратяване на поддържането на сайта и/или мобилното приложение;</p>\n" +
//                "\n" +
//                "<p>б/ взаимно съгласие на страните за прекратяването;</p>\n" +
//                "\n" +
//                "<p>в/ други предвидени в закона случаи.&nbsp;</p>\n" +
//                "\n" +
//                "<p>(2) В случай на прекратяване на договора между страните на каквото и да е основание, доставчика има право да спре незабавно достъпа на съответния потребител &nbsp;до потребителския му профил, да прекрати регистрацията му и да изтрие от сървъритеси цялото разположено от него потребителско съдържание, при спазване на изискванията на приложимото законодателство. В случай на прекратяване на договора доставчика не носи отговорност за претърпени вреди и пропуснати ползи от потребителя или трети лица, настъпили вследствие на спирането на достъпа на потребителя до потребителския му профил, прекратяването на регистрацията му, изтриването на разположеното от него потребителско съдържание от сървърите, които доставчика използва, както и вследствие предоставянето на информация или изпълнение на разпореждания на компетентните държавни органи.&nbsp;<br />\n" +
//                "Чл. 13 Заключителни разпоредби</p>\n" +
//                "\n" +
//                "<p>(1) Предвидените в договора и настоящите Общи условия писмени или електронни изявления и съобщения се считат за валидно извършени, ако са направени под формата на писмо с обратна разписка, електронна поща, натискане на виртуален бутон в сайта или мобилното приложение и други подобни, доколкото изявлението е записано технически по начин, който дава възможност да бъде възпроизведено.</p>\n" +
//                "\n" +
//                "<p>(2) С приемане на настоящите Общи условия и сключване на договор помежду си, страните изразяват съгласието си да считат отправените електронни изявления помежду им за получени с постъпването им в посочената от адресата информационна система, без за това да е необходимо изрично потвърждаване.<br />\n" +
//                "В случай, че потребителят е посочил невалидна електронна пощенска кутия, то изявлението ще се счита за получено само с изпращането му от доставчика, дори ако не е било получено.</p>\n" +
//                "\n" +
//                "<p>(3) Страните се съгласяват, че в случай, че някоя от клаузите по настоящите Общи условия се окаже недействителна, това няма да влече недействителност на договора, на други клаузи или негови части. Недействителната клауза ще бъде заместена от повелителните норми на закона или установената практика.</p>\n" +
//                "\n" +
//                "<p>(4)Сайтът и мобилното приложение се поддържат от доставчика посредством техническо оборудване, разположено на територията на Република България. Доставчикът не гарантира и не носи отговорност за достъпността и надлежното предоставяне на услугите на сайта и мобилното приложение извън територията на Република България. В случай, че потребителят ползва услугите, предмет на настоящите Общи условия, извън територията на Република България, той е единствено отговорен за спазване на приложимото законодателство съобразно с мястото на ползване на услугите.</p>\n" +
//                "\n" +
//                "<p>(5) За всички неуредени от настоящия договор въпроси се прилагат разпоредбите на действащото законодателство на Република България.</p>\n" +
//                "\n" +
//                "<p>(6) Всички спорове между страните се решават в дух на разбирателство и добра воля. В случай, че съгласие не бъде постигнато, всички неразрешени спорове, породени от договора между страните или отнасящи се до него, включително спорове, породени или отнасящи се до неговото тълкуване, недействителност, изпълнение или прекратяване, както и спорове за попълване на празноти в договора или приспособяването му към нововъзникнали обстоятелства, ще бъдат разрешавани от компетентния по действащото българско законодателство съд.&nbsp;</p>\n" +
//                "\n" +
//                "<p><br />\n" +
//                "Настоящите Общи условия са в сила от 06.05.2019&nbsp;г.</p>\n" +
//                "\n" +
//                "<p>&nbsp;</p>\n" +
//                "\n" +
//                "<p>&nbsp;</p>\n" +
//                "\n" +
//                "<p>&nbsp;</p>\n" +
//                "\n" +
//                "<p>&nbsp;</p>\n"));
    }

}
